# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
a = pd.Series(np.random.randint(1, 5, size=100))
b = pd.Series(np.random.randint(1, 4, size=100))
c = pd.Series(np.random.randint(10000, 30001, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [9]:
df = pd.concat([a, b, c], axis=1)
df

    0  1      2
0   1  1  10309
1   1  2  10768
2   2  2  15750
3   1  3  13475
4   4  2  26656
.. .. ..    ...
95  1  1  24234
96  1  3  27843
97  2  3  27103
98  2  1  13391
99  3  3  29294

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [16]:
df.rename(columns={0:"bedrs", 1:"bathrs", 2:"price_sqr_meter"}, inplace=True)
df

    bebrs  bathrs  price_sqr_meter
0       1       1            10309
1       1       2            10768
2       2       2            15750
3       1       3            13475
4       4       2            26656
..    ...     ...              ...
95      1       1            24234
96      1       3            27843
97      2       3            27103
98      2       1            13391
99      3       3            29294

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [24]:
bigcolumn = pd.concat([a, b, c], axis=0)

# transform from Series -> Frame
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       1
1       1
2       2
3       1
4       4
..    ...
95  24234
96  27843
97  27103
98  13391
99  29294

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [26]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [27]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.index

RangeIndex(start=0, stop=300, step=1)